###################################################################

# Created by write_sdc on Tue Nov 24 13:47:31 2015

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports resetn]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {seed[0]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[15]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[14]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[13]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[12]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[11]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[10]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[9]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[8]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[7]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[6]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[5]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[4]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[3]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[2]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[1]}]
set_load -pin_load 0.005 [get_ports {lfsr_out[0]}]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports resetn]
set_max_capacitance 0.005 [get_ports {seed[15]}]
set_max_capacitance 0.005 [get_ports {seed[14]}]
set_max_capacitance 0.005 [get_ports {seed[13]}]
set_max_capacitance 0.005 [get_ports {seed[12]}]
set_max_capacitance 0.005 [get_ports {seed[11]}]
set_max_capacitance 0.005 [get_ports {seed[10]}]
set_max_capacitance 0.005 [get_ports {seed[9]}]
set_max_capacitance 0.005 [get_ports {seed[8]}]
set_max_capacitance 0.005 [get_ports {seed[7]}]
set_max_capacitance 0.005 [get_ports {seed[6]}]
set_max_capacitance 0.005 [get_ports {seed[5]}]
set_max_capacitance 0.005 [get_ports {seed[4]}]
set_max_capacitance 0.005 [get_ports {seed[3]}]
set_max_capacitance 0.005 [get_ports {seed[2]}]
set_max_capacitance 0.005 [get_ports {seed[1]}]
set_max_capacitance 0.005 [get_ports {seed[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports resetn]
set_max_fanout 4 [get_ports {seed[15]}]
set_max_fanout 4 [get_ports {seed[14]}]
set_max_fanout 4 [get_ports {seed[13]}]
set_max_fanout 4 [get_ports {seed[12]}]
set_max_fanout 4 [get_ports {seed[11]}]
set_max_fanout 4 [get_ports {seed[10]}]
set_max_fanout 4 [get_ports {seed[9]}]
set_max_fanout 4 [get_ports {seed[8]}]
set_max_fanout 4 [get_ports {seed[7]}]
set_max_fanout 4 [get_ports {seed[6]}]
set_max_fanout 4 [get_ports {seed[5]}]
set_max_fanout 4 [get_ports {seed[4]}]
set_max_fanout 4 [get_ports {seed[3]}]
set_max_fanout 4 [get_ports {seed[2]}]
set_max_fanout 4 [get_ports {seed[1]}]
set_max_fanout 4 [get_ports {seed[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 0.8  -waveform {0 0.4}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports resetn]
set_input_delay -clock clk  0.05  [get_ports {seed[15]}]
set_input_delay -clock clk  0.05  [get_ports {seed[14]}]
set_input_delay -clock clk  0.05  [get_ports {seed[13]}]
set_input_delay -clock clk  0.05  [get_ports {seed[12]}]
set_input_delay -clock clk  0.05  [get_ports {seed[11]}]
set_input_delay -clock clk  0.05  [get_ports {seed[10]}]
set_input_delay -clock clk  0.05  [get_ports {seed[9]}]
set_input_delay -clock clk  0.05  [get_ports {seed[8]}]
set_input_delay -clock clk  0.05  [get_ports {seed[7]}]
set_input_delay -clock clk  0.05  [get_ports {seed[6]}]
set_input_delay -clock clk  0.05  [get_ports {seed[5]}]
set_input_delay -clock clk  0.05  [get_ports {seed[4]}]
set_input_delay -clock clk  0.05  [get_ports {seed[3]}]
set_input_delay -clock clk  0.05  [get_ports {seed[2]}]
set_input_delay -clock clk  0.05  [get_ports {seed[1]}]
set_input_delay -clock clk  0.05  [get_ports {seed[0]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[15]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[14]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[13]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[12]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[11]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[10]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[9]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[8]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[7]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[6]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[5]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[4]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[3]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[2]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[1]}]
set_output_delay -clock clk  0.05  [get_ports {lfsr_out[0]}]
